Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ВнутренниеДокументы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВнутренниеДокументы</name>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дело</name>
    <type>
      <types>CatalogRef.ДелаХраненияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Зарегистрировал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПриложений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЛистовВПриложениях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиВнутреннихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>Подразделение подготовившего</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИсполнения</name>
    <comment>Плановый срок исполнения</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Утвердил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧисловойНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Корреспонденты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>удуДержательДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>удуРебенок</name>
    <type>
      <types>CatalogRef.удуДети</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>удуДети</name>
    <attributes>
      <name>Ребенок</name>
      <type>
        <types>CatalogRef.удуДети</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/СостоянияДокументов/СостоянияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияДокументов</name>
  <enumValues>
    <name>Проект</name>
  </enumValues>
  <enumValues>
    <name>НаРассмотрении</name>
  </enumValues>
  <enumValues>
    <name>Рассмотрен</name>
  </enumValues>
  <enumValues>
    <name>НаИсполнении</name>
  </enumValues>
  <enumValues>
    <name>Исполнен</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>НаУтверждении</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>НеУтвержден</name>
  </enumValues>
  <enumValues>
    <name>НаРегистрации</name>
  </enumValues>
  <enumValues>
    <name>Зарегистрирован</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/ДелаХраненияДокументов/ДелаХраненияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДелаХраненияДокументов</name>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДелоЗакрыто</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛистов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураДел</name>
    <type>
      <types>CatalogRef.НоменклатураДел</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерТома</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дошкольное_учреждение83/src/ChartsOfCharacteristicTypes/ВидыДоступа/ВидыДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыДоступа</name>
  <type>
    <types>CatalogRef.ПапкиФайлов</types>
    <types>CatalogRef.ВнешниеПользователи</types>
    <types>CatalogRef.ГруппыВнешнихПользователей</types>
    <types>CatalogRef.ГруппыПользователей</types>
    <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    <types>CatalogRef.Пользователи</types>
    <types>CatalogRef.Организации</types>
    <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
  </type>
  <predefined>
    <items>
      <name>ВнешниеПользователи</name>
      <description>Внешние пользователи</description>
      <type>
        <types>CatalogRef.ВнешниеПользователи</types>
        <types>CatalogRef.ГруппыВнешнихПользователей</types>
      </type>
    </items>
    <items>
      <name>ДополнительныеСведения</name>
      <description>Дополнительные сведения</description>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </items>
    <items>
      <name>Организации</name>
      <description>Организации</description>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ПапкиФайлов</name>
      <description>Папки файлов</description>
      <type>
        <types>CatalogRef.ПапкиФайлов</types>
      </type>
    </items>
    <items>
      <name>Пользователи</name>
      <description>Пользователи</description>
      <type>
        <types>CatalogRef.ГруппыПользователей</types>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПравоДобавления</name>
      <description>Право добавления</description>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПравоИзменения</name>
      <description>Право изменения</description>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>ПравоЧтения</name>
      <description>Право чтения</description>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </items>
    <items>
      <name>УчетныеЗаписиЭлектроннойПочты</name>
      <description>Учетные записи электронной почты</description>
      <type>
        <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Дошкольное_учреждение83/src/Catalogs/ВнутренниеДокументы/ObjectModule.bsl
// Процедура ЗаполнитьНаборыЗначенийДоступа заполняет таблицу
// НаборыЗначений(НомерНабора, ВидДоступа, ЗначениеДоступа, Чтение, Добавление, Изменение, Удаление)
// по проверяемому объекту.
//
//  Вызывается из процедуры УправлениеДоступом.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения, добавление, изменение, удаление: по папке внутренних документов
	
	// Чтение, Добавление, Изменение: набор №1.
	Строка = Таблица.Добавить();
	Строка.Чтение          = Истина;
	Строка.Добавление      = Истина;
	Строка.Изменение       = Истина;
	Строка.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.ПапкиВнутреннихДокументов;
	Строка.ЗначениеДоступа = Папка;
	
	Строка = Таблица.Добавить();
	Строка.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.ВидыВнутреннихДокументов;
	Строка.ЗначениеДоступа = ВидДокумента;
	
	Строка = Таблица.Добавить();
	Строка.ВидДоступа      = ПланыВидовХарактеристик.ВидыДоступа.Организации;
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	РегистрационныйНомер = "";
	ЧисловойНомер 	= 0;
	ДатаРегистрации = '00010101';
	ДатаСоздания 	= ТекущаяДата();
	Зарегистрировал = Справочники.Пользователи.ПустаяСсылка();
	Подготовил 		= ОбщегоНазначения.ТекущийПользователь();
	Подразделение 	= РаботаСПользователями.ПолучитьПодразделение(Подготовил);
		
	КоличествоЛистов 	 = 1;
	КоличествоПриложений = 0;
	ЛистовВПриложениях 	 = 0;
	Дело = Справочники.ДелаХраненияДокументов.ПустаяСсылка();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда 
		
		РегистрационныйНомер = "";
		ЧисловойНомер 	= 0;
		ДатаРегистрации = '00010101';
		ДатаСоздания 	= ТекущаяДата();
		Зарегистрировал = Справочники.Пользователи.ПустаяСсылка();
		Подготовил 		= ОбщегоНазначения.ТекущийПользователь();
		Подразделение 	= РаботаСПользователями.ПолучитьПодразделение(Подготовил);
		
		КоличествоЛистов 	 = 1;
		КоличествоПриложений = 0;
		ЛистовВПриложениях 	 = 0;
		Дело = Справочники.ДелаХраненияДокументов.ПустаяСсылка();
		СрокИсполнения = '00010101';

		Если Не ЗначениеЗаполнено(ВидДокумента) Тогда 
			ВидДокумента = Делопроизводство.ПолучитьВидДокументаПоУмолчанию(Ссылка);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Организация) Тогда 
			Организация = РаботаСОрганизациями.ПолучитьОрганизациюПоУмолчанию();
		КонецЕсли;
			
	КонецЕсли;	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Основание") Тогда
		ЗаполнитьПараметрамиВводаНаОсновании(ДанныеЗаполнения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(РегистрационныйНомер) И ЗначениеЗаполнено(ДатаРегистрации) Тогда 
		Если Не Делопроизводство.РегистрационныйНомерУникален(ЭтотОбъект) Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Регистрационный номер не уникален!'"),
				ЭтотОбъект,
				"РегистрационныйНомер",, 
				Отказ);
		КонецЕсли;	
	КонецЕсли;	
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьРеквизитыУчетаПоКорреспондентам", Новый Структура("ВидДокумента", ВидДокумента)) Тогда 
		ПроверяемыеРеквизиты.Добавить("Корреспондент");
	КонецЕсли;	
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда 
		Если ЗначениеЗаполнено(Дело) И Организация <> Дело.Организация Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Дело не относится к организации документа.'"),
				ЭтотОбъект,
				"Дело",, 
				Отказ);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПараметрамиВводаНаОсновании(ПараметрыВводаНаОсновании) Экспорт
	
	// ввод на основании с копированием файлов
	Если ТипЗнч(ПараметрыВводаНаОсновании.Основание) = Тип("СправочникСсылка.ВходящиеДокументы")
	 Или ТипЗнч(ПараметрыВводаНаОсновании.Основание) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
		
		Заголовок = ПараметрыВводаНаОсновании.Основание.Заголовок;
		Папка = ПараметрыВводаНаОсновании.Папка;
		ВидДокумента = ПараметрыВводаНаОсновании.ВидДокумента;
		Организация = ПараметрыВводаНаОсновании.Основание.Организация;
		
		Если ВидДокумента.УчетПоКорреспондентам Тогда
			Если ТипЗнч(ПараметрыВводаНаОсновании.Основание) = Тип("СправочникСсылка.ВходящиеДокументы") Тогда 
				Корреспондент = ПараметрыВводаНаОсновании.Основание.Отправитель;
				КонтактноеЛицо = ПараметрыВводаНаОсновании.Основание.Подписал;
			ИначеЕсли ТипЗнч(ПараметрыВводаНаОсновании.Основание) = Тип("СправочникСсылка.ИсходящиеДокументы") Тогда
				Корреспондент = ПараметрыВводаНаОсновании.Основание.Получатель;
				КонтактноеЛицо = ПараметрыВводаНаОсновании.Основание.Адресат;
			КонецЕсли;	
		КонецЕсли;
		
		Записать();
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Ссылка, 
			ТекущаяДата(), 
			Перечисления.СостоянияДокументов.Проект, 
			ОбщегоНазначения.ТекущийПользователь());
		
		УстановитьПривилегированныйРежим(Истина);
		ОснованиеОбъект = ПараметрыВводаНаОсновании.Основание.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(ОснованиеОбъект.ПредметПереписки) Тогда 
			ЗаблокироватьДанныеДляРедактирования(ОснованиеОбъект.Ссылка, , ПараметрыВводаНаОсновании.УникальныйИдентификатор);
			ОснованиеОбъект.ПредметПереписки = Ссылка;
			ОснованиеОбъект.Записать();
			РазблокироватьДанныеДляРедактирования(ОснованиеОбъект.Ссылка, ПараметрыВводаНаОсновании.УникальныйИдентификатор);
		КонецЕсли;	
		УстановитьПривилегированныйРежим(Ложь);
		
		Для Каждого Элемент Из ПараметрыВводаНаОсновании.КопироватьФайлы Цикл
			Источник = Элемент.Значение;
			ИсточникОбъект = Источник.ПолучитьОбъект();
			
			ПриемникОбъект = ИсточникОбъект.Скопировать();
			ПриемникОбъект.ВладелецФайла = ЭтотОбъект.Ссылка;
			ПриемникОбъект.Автор = ОбщегоНазначения.ТекущийПользователь();
			ПриемникОбъект.ДатаСоздания = ТекущаяДата();
			ПриемникОбъект.Записать();
			
			Приемник = ПриемникОбъект.Ссылка;
			Если Не Источник.ТекущаяВерсия.Пустая() Тогда
				Версия = РаботаСФайлами.СоздатьВерсию(
				ТекущаяДата(),
				УниверсальноеВремя(ТекущаяДата()),
				Приемник,
				Приемник.Наименование,
				Источник.ТекущаяВерсия.Размер,
				Источник.ТекущаяВерсия.Расширение,
				Источник.ТекущаяВерсия.ФайлХранилище,
				Источник.ТекущаяВерсия.ТекстХранилище,
				Ложь,
				Источник.ТекущаяВерсия);
				
				РаботаСФайлами.ОбновитьВерсиюВФайле(Приемник, Версия, Источник.ТекущаяВерсия.ТекстХранилище);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ПараметрыВводаНаОсновании.Основание) = Тип("СправочникСсылка.Файлы") Тогда
		
		Заголовок = ПараметрыВводаНаОсновании.Основание.ПолноеНаименование;
		Папка = ПараметрыВводаНаОсновании.Папка;
		ВидДокумента = ПараметрыВводаНаОсновании.ВидДокумента;
		Организация = ПараметрыВводаНаОсновании.Организация;
		Корреспондент = ПараметрыВводаНаОсновании.Корреспондент;
		Записать();
		
		Делопроизводство.ЗаписатьСостояниеДокумента(
			Ссылка, 
			ТекущаяДата(), 
			Перечисления.СостоянияДокументов.Проект, 
			ОбщегоНазначения.ТекущийПользователь());
			
			
		Источник = ПараметрыВводаНаОсновании.Основание;
		ИсточникОбъект = Источник.ПолучитьОбъект();
			
		ПриемникОбъект = ИсточникОбъект.Скопировать();
		ПриемникОбъект.ВладелецФайла = ЭтотОбъект.Ссылка;
		ПриемникОбъект.Автор = ОбщегоНазначения.ТекущийПользователь();
		ПриемникОбъект.ДатаСоздания = ТекущаяДата();
		ПриемникОбъект.Записать();
		
		Приемник = ПриемникОбъект.Ссылка;
		Если Не Источник.ТекущаяВерсия.Пустая() Тогда
			Версия = РаботаСФайлами.СоздатьВерсию(
				ТекущаяДата(),
				УниверсальноеВремя(ТекущаяДата()),
				Приемник.Ссылка,
				Приемник.Наименование,
				Источник.ТекущаяВерсия.Размер,
				Источник.ТекущаяВерсия.Расширение,
				Источник.ТекущаяВерсия.ФайлХранилище,
				Источник.ТекущаяВерсия.ТекстХранилище,
				Ложь,
				Источник.ТекущаяВерсия);
			
			РаботаСФайлами.ОбновитьВерсиюВФайле(Приемник, Версия, Источник.ТекущаяВерсия.ТекстХранилище);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры	

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Наименование = Делопроизводство.НаименованиеДокумента(ЭтотОбъект);
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда 
		Если УправлениеДоступом.ЕстьПравоПоЗначениюДоступа("ПометкаУдаленияПапокИВнутреннихДокументов", Папка) Тогда
			РаботаСФайлами.ПометитьНаУдалениеПриложенныеФайлы(Ссылка, ПометкаУдаления);
		Иначе
			ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
								 НСтр("ru = 'У Вас нет права ""Пометка на удаление"" документа ""%1"".'"),
								 Строка(Ссылка));
		КонецЕсли;	
	КонецЕсли;
	
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Заполним дату начала дела, если не заполнена
	Если ЗначениеЗаполнено(Дело) И Не ЗначениеЗаполнено(Дело.ДатаНачала) И ЗначениеЗаполнено(ДатаРегистрации) Тогда 
		
		ДелоОбъект = Дело.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(ДелоОбъект.Ссылка);
		ДелоОбъект.ДатаНачала = ДатаРегистрации;
		ДелоОбъект.Записать();	
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Нумерация.ОсвободитьНомерПриУдалении(ЭтотОбъект);
	
КонецПроцедуры
